Revit 2027 API
WorksetId.InvalidWorksetId Property
 Get the invalid WorksetId whose IntegerValue is -1.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static WorksetId InvalidWorksetId { get; }
Public Shared ReadOnly Property InvalidWorksetId As WorksetId
	Get
public:
static property WorksetId^ InvalidWorksetId {
	WorksetId^ get ();
}
static member InvalidWorksetId : WorksetId with get
Property Value
WorksetId
See Also
Reference
WorksetId Class
Autodesk.Revit.DB Namespace